Public Attributes | List of all members
API_BuildingMaterialType Struct Reference
Attribute Management
Building Material type attribute representation. More...
#include <APIdefs_Attributes.h>
 Public Attributes
API_Attr_Head  | head
Contains the name and the index of the building material.
GS::UniString *  | id
The id of the building material.
GS::UniString *  | manufacturer
The manufacturer of the building material.
GS::UniString *  | description
The description of the building material.
Int32  | connPriority
The connection priority of the building material. Used when multiple elements intersect, the higher priority element will be shown at the intersection.
API_AttributeIndex  | cutFill
Index of the building material's cut fill.
short  | cutFillPen
Index of the building material's cut fill foreground pen.
short  | cutFillBackgroundPen
Index of the building material's cut fill background pen.
API_AttributeIndex  | cutMaterial
Index of the building material's cut material.
API_FillOrientationID  | cutFillOrientation
Orientation of the building material's cut fill.
double  | thermalConductivity
Thermal Conductivity of the building material.
double  | density
Density of the building material.
double  | heatCapacity
Heat capacity of the building material.
double  | embodiedEnergy
Embodied energy in the building material.
double  | embodiedCarbon
Embodied carbon in the building material.
bool  | showUncutLines
Show Contours in Model Views.
bool  | doNotParticipateInCollDet
Specifies if the building material participates in collision detection.
Detailed Description
Building Material type attribute representation.
Remarks
Most of the fields in this structure correspond to the items of the Building Material dialog in Archicad. Note that in AC17 the Energy Evaluation property parameters (thermalConductivity, density and heatCapacity) have been removed from the API_FilltypeType, they are now part of this structure.
Member Data Documentation
◆ connPriority
 API_BuildingMaterialType::connPriority
The connection priority of the building material. Used when multiple elements intersect, the higher priority element will be shown at the intersection.
◆ cutFill
 API_BuildingMaterialType::cutFill
Index of the building material's cut fill.
◆ cutFillBackgroundPen
 API_BuildingMaterialType::cutFillBackgroundPen
Index of the building material's cut fill background pen.
◆ cutFillOrientation
 API_BuildingMaterialType::cutFillOrientation
Orientation of the building material's cut fill.
◆ cutFillPen
 API_BuildingMaterialType::cutFillPen
Index of the building material's cut fill foreground pen.
◆ cutMaterial
 API_BuildingMaterialType::cutMaterial
Index of the building material's cut material.
◆ density
 API_BuildingMaterialType::density
Density of the building material.
◆ description
 API_BuildingMaterialType::description
The description of the building material.
◆ doNotParticipateInCollDet
 API_BuildingMaterialType::doNotParticipateInCollDet
Specifies if the building material participates in collision detection.
◆ embodiedCarbon
 API_BuildingMaterialType::embodiedCarbon
Embodied carbon in the building material.
◆ embodiedEnergy
 API_BuildingMaterialType::embodiedEnergy
Embodied energy in the building material.
◆ head
 API_BuildingMaterialType::head
Contains the name and the index of the building material.
◆ heatCapacity
 API_BuildingMaterialType::heatCapacity
Heat capacity of the building material.
◆ id
 API_BuildingMaterialType::id
The id of the building material.
◆ manufacturer
 API_BuildingMaterialType::manufacturer
The manufacturer of the building material.
◆ showUncutLines
 API_BuildingMaterialType::showUncutLines
Show Contours in Model Views.
◆ thermalConductivity
 API_BuildingMaterialType::thermalConductivity
Thermal Conductivity of the building material.